import React from "react";
import { ScrollView, Text, View } from "react-native";
import ReligionCard from "../../components/ReligionCard";
import { Button } from "@rneui/themed";
import { Redirect, router } from "expo-router";

const brahmaavatar = () => {
  const redirectToHome = () => {
    router.replace("/");
  };
  const redirectBack = () => {
    router.replace("/hindugods/mainhindugods");
  };
  return (
    <>
      <View
        style={{
          display: "flex",
          flexDirection: "row",
          justifyContent: "space-between",
          margin: "5px",
        }}
      >
        <Button color="secondary" onPress={redirectBack}>
          Back
        </Button>
        <Button color="secondary" onPress={redirectToHome}>
          Home
        </Button>
      </View>
      <ScrollView>
        <ReligionCard
          cardType="maingod"
          cardTitle="वाल्मिकी अवतार(Valmiki Avatar)"
          cardText="वाल्मिकी श्रद्धेय ऋषि और महाकाव्य रामायण के लेखक हैं। ब्रह्मा के अवतार के रूप में, वाल्मिकी ने भगवान राम और उनकी पत्नी सीता की कहानी सुनाने में महत्वपूर्ण भूमिका निभाई। रामायण एक नैतिक और आध्यात्मिक मार्गदर्शक के रूप में कार्य करती है जो धर्म, कर्तव्य और धार्मिकता के मूल्यों को सिखाती है। भगवान राम की भक्ति के माध्यम से वाल्मिकी को दिव्य ज्ञान और वेदों का ज्ञान प्राप्त हुआ,  जिससे वे हिंदू धर्म में एक प्रमुख व्यक्ति बन गए। भगवान ब्रह्मा के इस अवतार ने महाकाव्य रामायण को संस्कृत भाषा में संकलित किया। हिंदू धर्म में, महाकाव्यों के बीच अंतर है, एक श्रेणी में हमारे पास पुराण हैं, और दूसरी श्रेणी में, हमारे पास इतिहास (इतिहास) है। पूर्व को कोई भी लिख या कह सकता है लेकिन इतिहास का संकलन केवल उन लोगों द्वारा किया जाना चाहिए जिन्होंने व्यक्तिगत रूप से इसमें भाग लिया है। वाल्मिकी अवतार ने इतिहास का संकलन किया।"
          cardImage="valmiki"
          cardButtonColor="#FFA500"
          buttonRedirectUrl=""
        />
        <ReligionCard
          cardType="maingod"
          cardTitle="Shukra Avatar"
          cardText="शुक्र, जिसे शुक्र के नाम से भी जाना जाता है, हिंदू धर्म में असुरों या राक्षसों का गुरु है। ब्रह्मा के अवतार के रूप में, शुक्र की बुद्धि और ज्योतिष, आध्यात्मिकता और वेदों का ज्ञान अद्वितीय माना जाता था। वह अक्सर धन, सुख और प्रजनन क्षमता से जुड़ा होता है। उन्हें शुक्र नीति लिखने का श्रेय भी दिया जाता है। यह शासन, शासन कला और नैतिकता के सिद्धांतों का विवरण देने वाला धर्मग्रंथ है।"
          cardImage="shukra"
          cardButtonColor="#FFA500"
          buttonRedirectUrl=""
        />
        <ReligionCard
          cardType="maingod"
          cardTitle="बृहस्पति अवतार (Brahaspati Avatar)"
          cardText="बृहस्पति देवों के गुरु और ज्ञान, वाक्पटुता और विद्या के देवता हैं। ब्रह्मा के अवतार के रूप में, बृहस्पति ज्ञान और आध्यात्मिकता की खोज में देवताओं का मार्गदर्शन करने के लिए जिम्मेदार हैं। उनका संबंध बृहस्पति ग्रह से भी है और उन्हें वेदों का शिक्षक और ऋता नामक ब्रह्मांडीय व्यवस्था का स्वामी माना जाता है। बृहस्पति की बुद्धि और सलाह ने हिंदू धर्म में एक आवश्यक भूमिका निभाई है क्योंकि यह किसी की आध्यात्मिक यात्रा में गुरु के महत्व को उजागर करता है।"
          cardImage="brahaspati"
          cardButtonColor="#FFA500"
          buttonRedirectUrl=""
        />
        <ReligionCard
          cardType="maingod"
          cardTitle="व्यास अवतार(Vyas Avatar)"
          cardText="व्यास, जिन्हें वेद व्यास के नाम से भी जाना जाता है, महान महाकाव्य महाभारत के लेखक और वेदों के संकलनकर्ता हैं। ब्रह्मा के अवतार के रूप में, व्यास ने वेदों और अन्य पवित्र ग्रंथों के ज्ञान को संरक्षित और प्रसारित करने में महत्वपूर्ण भूमिका निभाई। महाभारत, जो कुरुक्षेत्र युद्ध की कहानी बताता है और भगवद गीता धार्मिक जीवन और आध्यात्मिक विकास के लिए एक मार्गदर्शक है। हिंदू धर्म में व्यास के योगदान ने उन्हें देश में सबसे सम्मानित शख्सियतों में से एक बना दिया है।"
          cardImage="vyas"
          cardButtonColor="#FFA500"
          buttonRedirectUrl=""
        />
        <ReligionCard
          cardType="maingod"
          cardTitle="खत अवतार (Khat Avatar)"
          cardText="खत अवतार पर एक अलग लेख में चर्चा की गई है जिसे आप यहां पा सकते हैं । खत अवतार उन छह ऋषियों को संदर्भित करता है जिन्हें ब्रह्मा का दिव्य अवतार माना जाता है। वे भारतीय दर्शन के संस्थापक हैं। ऐसा माना जाता है कि एक बार व्यास को ईश्वर ने शाप दिया था कि उन्हें भारतीय दर्शन के छह विद्यालयों को बनाने के लिए 6 रूपों में छोटा होना पड़ेगा।"
          cardImage="khat"
          cardButtonColor="#FFA500"
          buttonRedirectUrl=""
        />
        <ReligionCard
          cardType="maingod"
          cardTitle="कालिदास अवतार (Kalidas Avatar)"
          cardText="कालिदास शास्त्रीय संस्कृत साहित्य के एक प्रसिद्ध कवि और नाटककार हैं। ब्रह्मा के अवतार के रूप में, प्रेम, सौंदर्य और मानवीय अनुभव पर कालिदास के कार्यों ने भारतीय साहित्य और संस्कृति पर एक स्थायी प्रभाव छोड़ा है। उनकी सबसे प्रसिद्ध कृतियों में अभिज्ञान शाकुंतलम जैसे नाटक और मेघदूत और कुमारसंभव जैसी कविताएँ शामिल हैं। उन्हें भारत का शेक्सपियर भी कहा जाता है।"
          cardImage="kalidas"
          cardButtonColor="#FFA500"
          buttonRedirectUrl=""
        />
        <ReligionCard
          cardType="maingod"
          cardTitle="कालिदास अवतार (Dattatreya Avatar)"
          cardText="वह ब्रह्मा के सबसे ज्ञानी अवतारों में से एक थे। साथ ही उन्हें दुनिया का पहला शिक्षक भी माना जाता है। दत्तात्रेय ने विष्णु के अवतार परशुराम को भी शिक्षा दी। विष्णु के अवतारों के बारे में पढ़ने के लिए आप यहां क्लिक कर सकते हैं । उन्हें आदि-गुरु के नाम से भी जाना जाता है। उनके ज्ञान का प्रमुख स्रोत प्रकृति ही थी। दिलचस्प बात यह है कि उन्हें एक साथ ब्रह्मा, विष्णु और महेश के अवतारों में से एक माना जाता है।"
          cardImage="kalidas"
          cardButtonColor="#FFA500"
          buttonRedirectUrl=""
        />
      </ScrollView>
    </>
  );
};

export default brahmaavatar;
