import React from "react";
import { ScrollView, Text, View } from "react-native";
import ReligionCard from "../../components/ReligionCard";
import { Button } from "@rneui/themed";
import { Redirect, router } from "expo-router";

const vishnuavatar = () => {
  const redirectToHome = () => {
    router.replace("/");
  };
  const redirectBack = () => {
    router.replace("/hindugods/mainhindugods");
  };
  return (
    <>
      <View
        style={{
          display: "flex",
          flexDirection: "row",
          justifyContent: "space-between",
          margin: "5px",
        }}
      >
        <Button color="secondary" onPress={redirectBack}>
          Back
        </Button>
        <Button color="secondary" onPress={redirectToHome}>
          Home
        </Button>
      </View>
      <ScrollView>
        <ReligionCard
          cardType="maingod"
          cardTitle="मत्स्य अवतार (Matsya Avatar)"
          cardText="मत्स्यावतार (Matsyavatar) भगवान विष्णु का प्रथम अवतार है। यह अवतार सृष्टि के क्रम को पुनः स्थापित करने के लिए गया था। सतयुग के आदि में राजा सत्यवृत्त (मनु) हुए थे।
            भगवान ने मत्स्य अवतार में सत्यवृत से कहा- सुनो राजा सत्यवृत! आज से सात दिन बाद प्रलय होगी। तब मेरी प्रेरणा से एक विशाल नाव तुम्हारे पास आएगी। तुम सप्त ऋषियों, औषधियों, बीजों व प्राणियों के सूक्ष्म शरीर को लेकर उसमें बैठ जाना।सत्यव्रत ने ठीक ऐसा ही किया। रास्ते में भगवान मत्स्य नारायण ने मनु को मत्स्य पुराण भी सुनाया। इस तरह प्रभु ने सबकी प्रलय से रक्षा की, तथा पौधों तथा जीवों की नस्लों को बचाया।"
          cardImage="matsya"
          cardButtonColor="#FFA500"
          buttonRedirectUrl=""
        />
        <ReligionCard
          cardType="maingod"
          cardTitle="कूर्म अवतार (Kurma Avatar)"
          cardText="कूर्म अवतार भगवान विष्णु का दूसरा अवतार है, इसे ‘कच्छप अवतार’ भी कहते हैं। जब देवता और दानव श्रीसागर में समुन्द्र मंथन कर रहे थे तो मंदराचल पर्वत को मथानी एवं नागराज वासुकि को नेती बनाया गया था। किंतु मंदराचल के नीचे कोई आधार नहीं होने के कारण वह समुद्र में डूबने लगा।

        यह देखकर भगवान विष्णु विशाल कूर्म (कछुए) का रूप धारण कर मंदारचल पर्वत को अपने कवच पर संभाला था। भगवान कूर्म की विशाल पीठ पर मंदराचल तेजी से घुमने लगा और इस प्रकार समुद्र मंथन संपन्न हो पाया।"
          cardImage="kurma"
          cardButtonColor="#FFA500"
          buttonRedirectUrl=""
        />

        <ReligionCard
          cardType="maingod"
          cardTitle="वराह अवतार (Varaha Avatar)"
          cardText="वराह अवतार भगवान विष्णु के तृतीय अवतार थे। इन्हें शुकर अवतार भी कहते है। इस अवतार में मुख शुकर का था, लेकिन शरीर इंसान का। यह भद्रप्रद, शुक्ल पक्ष की तृतीया को अवतरित हुए थे। इस अवतार पर 18 पुराणों में से एक पुराण वराह पुराण भी है।

        एक समय राक्षसराज हिरण्याक्ष ने जब पृथ्वी को जल में डुबो दिया था तब ब्रह्मा की नाक से भगवान विष्णु वराह रूप में प्रकट हुए। भगवान विष्णु के इस रूप को देखकर सभी देवताओं व ऋषि-मुनियों ने उनकी स्तुति की। सबके आग्रह पर भगवान वराह ने पृथ्वी को टूंढना प्रारंभ किया। अपनी थूधनी की सहायता से उन्होंने पृथ्वी का पता लगा लिया और समुद्र के अंदर जाकर अपने दांतों पर रखकर वे पृथ्वी को बाहर ले आए।हिरण्याक्ष और वराह के मध्य भीषण युद्ध हुआ। अंत में भगवान वराह ने हिरण्याक्ष का वध कर दिया। इसके बाद भगवान वराह ने अपने खुरों से जल को स्तंभित कर उस पर पृथ्वी को स्थापित कर दिया।"
          cardImage="varah"
          cardButtonColor="#FFA500"
          buttonRedirectUrl=""
        />
        <ReligionCard
          cardType="maingod"
          cardTitle="भगवान नृसिंह (Narsingha Avatar)"
          cardText="नरसिंह नर + सिंह (“मानव-सिंह”) को पुराणों में भगवान विष्णु केे अवतार है। अवतार में विष्णु आधे मानव और आधे सिंह के रूप में प्रकट हुए थे। इनका सिर एवं धड तो मानव का था लेकिन चेहरा एवं पंजे सिंह (शेर) की तरह थे। यह अवतार प्रह्लाद की रक्षा एवं दुष्ट हिरणकश्यप के संहार के लिए लिया था।

ब्रह्म से हिरण्यकश्यप को यह वरदान था कि उसकी मृत्यु न दिन में, न रात में, न धरती में, न आकाश में, न दिन में, न रात में, न अस्त्र से, न शस्त्र से, न देवता से, न दानव से, न पशु से न पक्षी से होगी। इस घमण्ड से फलीभूत होकर वह अत्यन्त शक्तिशाली और अत्याचारी हो गया। वह अपने आपको भगवान मानता था, और जो विष्णु की पूजा करता था उसे मृत्यु दंड देता है।

जब हिरण्यकश्यप को यह बात पता चला कि उसका पुत्र ‘प्रह्लाद‘ विष्णु की पूजा करता है। तो उसे खूब समझाया फिर भी जब प्रह्लाद नहीं माना तो हिरण्यकशिपु ने उसे मृत्युदंड देने का निश्चय किया। उसे सांप के बीच छोड़ दिया, पहाड़ से गिरा दिया। लेकिन प्रह्लाद हर बार विष्णु की कृपा से बच गया।

हिरण्यकशिपु की बहन होलिका, जिसे अग्नि से न जलने का वरदान प्राप्त था, वह प्रह्लाद को लेकर धधकती हुई अग्नि में बैठ गई। तब भी भगवान विष्णु की कृपा से प्रह्लाद बच गया और होलिका जल गई।

जब हिरण्यकशिपु स्वयं प्रह्लाद को मारने ही वाला था तब भगवान विष्णु नृसिंह का अवतार लेकर ये से प्रकट हुए और उन्होंने अपने नाखूनों से हिरण्यकशिपु का वध कर दिया"
          cardImage="narsingha"
          cardButtonColor="#FFA500"
          buttonRedirectUrl=""
        />
        <ReligionCard
          cardType="maingod"
          cardTitle="वामन अवतार (Vanana Avatar)"
          cardText="वामन विष्णु के पाँचवे तथा त्रेता युग के पहले अवतार थे। इसके साथ ही यह विष्णु के पहले ऐसे अवतार थे जो मानव रूप में प्रकट हुए इनको दक्षिण भारत में उपेन्द्र के नाम से भी जाना जाता है।

सत्ययुग में प्रसाद के पौत्र दैत्यराज बलि ने स्वर्गलोक पर अधिकार कर लिया। सभी देवता इस विपत्ति से बचने के लिए भगवान विष्णु के पास गए। तब भगवान विष्णु ने कहा कि मैं स्वयं देवमाता अदिति के गर्भ से उत्पन्न होकर तुम्हें स्वर्ग का राज्य दिलाऊंगा। कुछ समय पश्चात भगवान विष्णु ने वामन अवतार लिया।

एक बार जब बलि महान यज्ञ कर रहा था तब भगवान वामन बलि की यज्ञशाला में गए और राजा बलि से तीन पग धरती दान में मांगी। राजा बलि के गुरु शुक्राचार्य भगवान की लीला समझ गए और उन्होंने बलि को दान देने से मना कर दिया। लेकिन बलि ने फिर भी भगवान वामन को तीन पग धरती दान देने का संकल्प ले लिया। भगवान वामन ने विशाल रूप धारण कर एक पग में धरती और दूसरे पग मैं स्वर्ग लोक नाप लिया।

जब तीसरा पग रखने के लिए कोई स्थान नहीं बचा तो बलि ने भगवान बामन को अपने सिर पर पग रखने को कहा। बलि के सिर पर पग रखने से वह सुतललोक पहुंच गया। बलि की दानवीरता देखकर भगवान ने उसे सुतललोक का स्वामी भी बना दिया। इस तरह भगवान वामन ने देवताओं की सहायता कर उन्हें स्वर्ग पुन: लौटाया।"
          cardImage="vaman"
          cardButtonColor="#FFA500"
          buttonRedirectUrl=""
        />
        <ReligionCard
          cardType="maingod"
          cardTitle="परशुराम अवतार (Parshuram Avatar)"
          cardText="परशुराम, भगवान विष्णु का छठा अवतार हैं। इनका जन्म महर्षि भृगु के पुत्र महर्षि जमदग्नि द्वारा सम्पन्न पुत्रेष्टि यज्ञ से प्रसन्न देवराज इन्द्र के वरदान स्वरूप पत्नी रेणुका के गर्भ से वैशाख शुक्ल तृतीया को मध्यप्रदेश के इंदौर जिला में ग्राम मानपुर के में हुआ था।

पितामह भृगु द्वारा सम्पन्न नामकरण संस्कार के अनन्तर राम कहलाए। वे जमदग्नि का पुत्र होने के कारण जामदग्न्य और शिवजी द्वारा प्रदत्त परशु धारण किये रहने के कारण वे परशुराम कहलाये।

जब जमदग्नि को कीर्तिवीर्य नामक राजा ने ठगा तो परशुराम ने उसका वध कर दिया लेकिन ऐसा करने से जमदग्नि की कीर्तिवीर्य के पूत्रों ने हत्या कर दी। परशुराम ने इससे हतोत्साहित होकर पूरी पृथ्वी को क्षत्रियांवहीन करने का निर्णय लिया था और अपने इस संकल्प को 21 बार पूरा किया।"
          cardImage="parshuram"
          cardButtonColor="#FFA500"
          buttonRedirectUrl=""
        />
        <ReligionCard
          cardType="maingod"
          cardTitle="श्रीराम अवतार (Ram Avatar)"
          cardText="श्री राम भगवान विष्णु के सातवें अवतार हैं। इन्हें श्रीराम और श्रीरामचन्द्र के नामों से भी जाना जाता है। रामायण में वर्णन के अनुसार अयोध्या के सूर्यवंशी राजा, चक्रवर्ती सम्राट दशरथ ने पुत्र की कामना से यज्ञ कराया जिसके फलस्वरूप उनके पुत्रों का जन्म हुआ।

श्रीराम का जन्म देवी कौशल्या के गर्भ से अयोध्या में हुआ था। श्रीराम जी चारों भाइयों में सबसे बड़े थे। हर वर्ष चैत्र मास के शुक्ल पक्ष की नवमी तिथि को श्रीराम जयंती या राम नवमी का पर्व मनाया जाता है।

त्रेतायुम में राक्षसराज रावण का बहुत आतंक था। उससे देवता भी डरते थे। उसके वध के लिए विष्णु ने राजा दशरथ के यहां माता कौशल्या के गर्भ से पुत्र रूप में जन्म लिया।"
          cardImage="ram"
          cardButtonColor="#FFA500"
          buttonRedirectUrl=""
        />
        <ReligionCard
          cardType="maingod"
          cardTitle=" श्रीकृष्ण अवतार (Krishna Avatar)"
          cardText="श्रीकृष्ण भगवान विष्णु के 8 वें अवतार थे। इन्हें कान्हा, गोपाल, केशव, द्वारकेश या द्वारकाधीश, वासुदेव आदि नामों से भी उनको जाना जाता हैं। इनका जन्म मधुरा में हुआ था। उनके पिता का नाम बसुदेव और माता का नाम देवकी था। उनके नाना (उनकी माता देवकी के ज्येष्ठ पिता) मथुरा के राजा के राजा थे। उनका पुत्र कंस उन्हें हटाकर स्वयं राजा बन बैठा।

ऐसी भविष्यवाणी हुई थी कि देवकी के गर्भ से उत्पन्न हुई आठवीं संतान के द्वारा उसका वध होगा, अत: कंस ने कृष्ण की मारने की अनेक चेष्टाएँ की; किंतु कृष्ण ने अपने अद्भुत पुरुषार्थ से बाधाओं को पार करके अंत में कंस का वध किया।

इसी बीच हस्तिनापुर में कौरवों और पांडवों में राज्य के बटवारे को लेकर संघर्ष हुआ। कृष्ण पांडवों के सहायक थे। पहले उन्होंने शांति के साथ पांडवों को अधिकार दिलाना चाहा: किंतु कौरवों के दुराग्रह से का महाभारत युद्ध हुआ।

महाभारत के युद्ध में अर्जुन के सारथि बने और दुनिया को श्रीमद्भागवत गीता का ज्ञान दिया। धर्मराज युधिष्ठिर को राजा बना कर धर्म की स्थापना की। भगवान विष्णु का ये अवतार सभी अवतारों में सबसे श्रेष्ठ माना जाता है।"
          cardImage="krishna"
          cardButtonColor="#FFA500"
          buttonRedirectUrl=""
        />
        <ReligionCard
          cardType="maingod"
          cardTitle="बुद्ध अवतार (Budha Avatar)"
          cardText="बुद्धावतार भगवान् विष्णु का 9 वाँ अवतार है। आधुनिक मान्यतानुसार गौतम बुद्ध को ही बुद्धावतार माना जाता है परन्तु पुराणों के अध्ययन से ज्ञात होता है कि गौतम तथा बुद्ध दोनो भिन्न व्यक्ति थे। भागवत स्कन्ध 1 अध्याय 6 के श्लोक 24 अनुसार-

ततः कलौ सम्प्रवृत्ते सम्मोहाय सुरद्विषाम्।
बुद्धोनाम्नाजनसुतः कीकटेषु भविष्यति॥

अर्थात:- कलयुग में देवद्वेषियों को मोहित करने नारायण कीकट प्रदेश (बिहार या उड़ीसा) में अजन के पुत्र के रूप में प्रकट होंगे। 

जबकि गौतम का जन्म वर्तमान नेपाल में राजा शुद्धोदन के घर हुआ था।"
          cardImage="buddha"
          cardButtonColor="#FFA500"
          buttonRedirectUrl=""
        />
        <ReligionCard
          cardType="maingod"
          cardTitle="कल्कि अवतार (Kalki Avatar)"
          cardText="विष्णु के दशावतार में सिर्फ कल्कि अवतार होना ही शेष है। भविष्यपुराण अनुसार भगवान विष्णु का अगला अवतार कलयुग के चौथे चरण में उत्तरप्रदेश राज्य के शंभल नामक शहर में विष्णुयशा नामक ब्राह्मण के घर में होगा।

ऐसा कहा गया है कि कल्कि अवतार श्वेत अश्व (सफेद घोड़े) पर आरूढ़ हो प्रज्वलिंग खड्ग धारण कर मानव के रूप में अवतार लेकर स्वर्ण युग की पुनः स्थापना कर मानव जाति का कल्याण करेंगे।"
          cardImage="kalki"
          cardButtonColor="#FFA500"
          buttonRedirectUrl=""
        />
      </ScrollView>
    </>
  );
};

export default vishnuavatar;
