import { ScrollView, Text, View } from "react-native";
import ReligionCard from "../../components/ReligionCard";
import { Button } from "@rneui/themed";
import { Redirect, router } from "expo-router";

export default function MainHinduGods() {
  const redirectToHome = () => {
    router.replace("/");
  };
  const redirectBack = () => {
    router.replace("/");
  };
  return (
    <>
      <View
        style={{
          display: "flex",
          flexDirection: "row",
          justifyContent: "space-between",
          margin: "5px",
        }}
      >
        <Button color="secondary" onPress={redirectBack}>
          Back
        </Button>
        <Button color="secondary" onPress={redirectToHome}>
          Home
        </Button>
      </View>
      <ScrollView>
        <ReligionCard
          cardType="maingod"
          cardTitle="ब्रह्मा (Brahma)"
          cardText="ब्रह्मा सनातन धर्म के अनुसार सृजन के देव है।[1] हिन्दू दर्शनशास्त्रों में ३ प्रमुख देव बताये गये है जिसमें ब्रह्मा सृष्टि के सर्जक, विष्णु पालक और महेश विलय करने वाले देवता हैं।[2] व्यासलिखित पुराणों में ब्रह्मा का वर्णन किया गया है कि उनके पाँच मुख थे, [3]लेकिन पांचवा मुख भगवान शंकर ने क्रोध में आकर काट दिया क्योंकि ब्रह्मा जी द्वारा असत्य बोला गया था।[4] [3] इसके बाद से उनके चार मुख ही है जो चार दिशाओं में देखते हैं।[5] ब्रह्मा जी ब्रह्म का ही एक स्वरूप है ।[6][6] हिन्दू विश्वास के अनुसार हर वेद ब्रह्मा के एक मुँह से निकला था।[5][7] सरस्वती ब्रह्मा जी की पत्नी हैं। ब्रह्मा के सर्वप्रथम 4 मानस पुत्र हुए - सनकादिक ऋषि,फिर 10 अंगों से 10 ऋषि मानस पुत्र हुए नारद दक्ष वशिष्ठ अत्रि आदि। मैथुनी सृष्टि को बनाने के लिए आधे अंग से मनु और आधे अंग से शतरूपा को उत्पन्न किया जो सृष्टि के आदि पुरुष व महिला है।।[8] बहुत से पुराणों में ब्रह्मा की रचनात्मक गतिविधि उनसे बड़े किसी देव (ब्रह्म) की मौजूदगी और शक्ति (देवी दुर्गा) पर निर्भर करती है।"
          cardImage="brahma"
          cardButtonColor="#FFA500"
          buttonRedirectUrl="/brahmaavatars/brahmaavatar"
        />
        <ReligionCard
          cardType="maingod"
          cardTitle="विष्णु (Vishnu)"
          cardText="विष्णु की पत्नी लक्ष्मी हैं। विष्णु का निवास क्षीरसागर है। उनका शयन शेषनाग के ऊपर है। सम्पूर्ण जीवों के आश्रय होने के कारण भगवान श्री विष्णु ही नारायण कहे जाते हैं। सर्वव्यापक परमात्मा ही भगवान श्री विष्णु हैं। यह सम्पूर्ण विश्व भगवान विष्णु की शक्ति से ही संचालित है। वे निर्गुण भी हैं और सगुण भी। वे अपने चार हाथों में क्रमश: शंख, चक्र, गदा और पद्म धारण करते हैं। जो किरीट और कुण्डलों से विभूषित, पीताम्बरधारी, वनमाला तथा कौस्तुभमणि को धारण करने वाले, सुन्दर कमलों के समान नेत्र वाले भगवान श्री विष्णु का ध्यान करता है वह भव-बन्धन से मुक्त हो जाता है।"
          cardImage="vishnu"
          cardButtonColor="#FFA500"
          buttonRedirectUrl="/vishnuavatars/vishnuavatar"
        />
        <ReligionCard
          cardType="maingod"
          cardTitle="महेश (Mahesh)"
          cardText="भगवान महेश और माता पार्वती की कृपा से 72 क्षत्रिय उमरावों को पुनर्जीवन मिला और माहेश्वरी समाज की उत्पत्ति हुई इसलिए भगवान महेश और माता पार्वती को माहेश्वरी समाज के संस्थापक मानकर माहेश्वरी समाज में यह उत्सव 'माहेश्वरी वंशोत्पत्ति दिन' के रुपमें बहुत ही भव्य रूप में और बड़ी ही धूम-धाम से मनाया जाता है. इस उत्सव की तैयारी पहले से ही शुरु हो जाती है. इस दिन धार्मिक व सांस्कृतिक कार्यक्रम किए जाते हैं, शोभायात्रा निकाली जाती हैं,महेश वंदना गाई जाती है, भगवान महेशजी की महाआरती होती है. यह पर्व भगवान महेश और पार्वती के प्रति पूर्ण भक्ति और आस्था प्रगट करता है."
          cardImage="mahesh"
          cardButtonColor="#FFA500"
          buttonRedirectUrl="/shivaavatars/shivaavatar"
        />
      </ScrollView>
    </>
  );
}
